<a href="https://colab.research.google.com/github/seoran/github-slideshow/blob/master/python_pandas_%EA%B8%B0%EC%B4%88%EA%B0%95%EC%9D%981.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [3]:
df=pd.DataFrame(
    {"a":[4,5,6],
     "b":[7,8,9],
     "c":[10,11,12]},
     index=[1,2,3]
)

In [4]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [5]:
df["a"]

1    4
2    5
3    6
Name: a, dtype: int64

In [6]:
df["b"]

1    7
2    8
3    9
Name: b, dtype: int64

In [7]:
df["c"]

1    10
2    11
3    12
Name: c, dtype: int64

In [11]:
df[["a","c"]]

   a   c
1  4  10
2  5  11
3  6  12

In [13]:
df.loc[3]

a     6
b     9
c    12
Name: 3, dtype: int64

In [14]:
df.loc[3,"a"]

6

In [15]:
df.loc[[1,2],["a","b"]]

   a  b
1  4  7
2  5  8

In [26]:
 
df = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12]],
index=[1, 2, 3],
columns=['a', 'b', 'c'])

df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [6]:
import numpy as np
import pandas as pd

df = pd.DataFrame(
{"a" : [4 ,5, 6, 6,np.nan],
"b" : [7, 8, np.nan, 9, 9],
"c" : [10, 11, 12, np.nan, 12]},
index = pd.MultiIndex.from_tuples(
[('d',1),('d',2),('e',2),('e',3),('e',4)],
names=['n','v']))

df

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
  4  NaN  9.0  12.0

In [41]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12
  3  6  9  12

In [29]:
df[df.a<7]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [30]:
df[df.b>7]

   a  b   c
2  5  8  11
3  6  9  12

In [31]:
df.b>7

1    False
2     True
3     True
Name: b, dtype: bool

In [34]:
df[df.c>=7]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [42]:
df.drop_duplicates(inplace=True)

In [44]:
df["b"] !=7

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [ ]:
df['a'].isin([5])

n  v
d  1    False
   2     True
e  2    False
Name: a, dtype: bool

In [7]:
pd.isnull(df)

         a      b      c
n v
d 1  False  False  False
  2  False  False  False
e 2  False   True  False
  3  False  False   True
  4   True  False  False

In [9]:
df['a'].isnull().sum()

1

In [10]:
df.notnull().sum()

a    4
b    4
c    4
dtype: int64

In [11]:
df.a.notnull()

n  v
d  1     True
   2     True
e  2     True
   3     True
   4    False
Name: a, dtype: bool

In [ ]:
Logical and, or, not, xor, any, all

In [13]:
df.all()

a    True
b    True
c    True
dtype: bool

In [14]:
-df.a.notnull()

n  v
d  1    False
   2    False
e  2    False
   3    False
   4     True
Name: a, dtype: bool

In [15]:
1 and 2

2

In [16]:
True and False

False

df[df.b == 7 ] | df[df.a == 5 ]

In [26]:
df.head(2)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0

In [30]:
df.sample(frac=0.3)

       a    b     c
n v
d 2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [31]:
df.sample(n=3)

       a    b     c
n v
e 2  6.0  NaN  12.0
d 2  5.0  8.0  11.0
e 3  6.0  9.0   NaN

In [32]:
df.sample(n=5)

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 3  6.0  9.0   NaN
  2  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [33]:
df.iloc[10:20]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [35]:
df.iloc[:3]

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [36]:
 df.nlargest(3,'a')

       a    b     c
n v
e 2  6.0  NaN  12.0
  3  6.0  9.0   NaN
d 2  5.0  8.0  11.0

In [40]:
df.nlargest(2,'c')

       a    b     c
n v
e 2  6.0  NaN  12.0
  4  NaN  9.0  12.0

In [44]:
df.nsmallest(3, 'a')

       a    b     c
n v
d 1  4.0  7.0  10.0
  2  5.0  8.0  11.0
e 2  6.0  NaN  12.0

In [45]:
df.iloc[-2:]

       a    b     c
n v
e 3  6.0  9.0   NaN
  4  NaN  9.0  12.0